import React from 'react'
import './about.css'
import Navbar from '../asset/Navbar'
import {Link} from 'react-router-dom'
import Kitty3 from '../asset/img/kitty3.png'

function About() {
  return (
    
    <div className='About-body'>
      <Navbar />
      <div className='about-us-container'>
        <div className='A-img'><img src={Kitty3} alt=''/></div>
      <h1>About Us</h1>
      <p>การทำเว็บไซต์เกี่ยวกับแมวมีความสำคัญอย่างมากในปัจจุบัน เนื่องจากมีประชากรที่รักสัตว์เลี้ยงมีเพิ่มมากขึ้น และแมวเป็นสัตว์เลี้ยงที่นิยมอย่างแพร่หลาย นี่คือเหตุผลที่ควรพิจารณาการทำเว็บไซต์เกี่ยวกับแมว:
        <br/>ประสิทธิภาพในการสื่อสาร: เว็บไซต์เป็นช่องทางสำคัญในการสื่อสารกับเจ้าของแมวและชุมชนของผู้รักแมวอื่นๆ ที่มีความสนใจในการแลกเปลี่ยนประสบการณ์, คำแนะนำ, และข้อมูลที่เกี่ยวกับการดูแลแมว.
        <br/>การแบ่งปันความรู้: เว็บไซต์เกี่ยวกับแมวสามารถให้ข้อมูลเกี่ยวกับการดูแลแมว, การฝึก, อาหารที่เหมาะสม, และอื่นๆ เพื่อช่วยให้เจ้าของแมวเข้าใจและดูแลแมวได้อย่างเหมาะสม.
        <br/>การเชื่อมโยงกับบริการอื่นๆ: เว็บไซต์เกี่ยวกับแมวสามารถเชื่อมโยงไปยังบริการอื่นๆ เช่น ร้านขายอาหารสัตว์เลี้ยง, บริการสุขภาพสัตว์, หรือการเล่นสนุกสำหรับแมว เพื่อให้เจ้าของแมวสามารถเข้าถึงบริการที่ต้องการได้อย่างง่ายดาย.
        <br/>ชุมชนแมวออนไลน์: เว็บไซต์เกี่ยวกับแมวสร้างชุมชนออนไลน์ที่ทรงพลัง ที่เป็นสถานที่ที่เจ้าของแมวและคนที่สนใจสามารถแลกเปลี่ยนความคิดเห็น, ประสบการณ์, และข้อมูลเกี่ยวกับแมวได้.
        <br/>เสริมสร้างการตลาด: สำหรับธุรกิจที่เกี่ยวข้องกับสินค้าหรือบริการที่เกี่ยวข้องกับแมว, เว็บไซต์เป็นเครื่องมือที่ดีในการโปรโมตและขายสินค้าหรือบริการของตน.
      </p>


      <div className='Card-body'>
   
    <div className='cardcontainer'>
      
        <div className='Cardd reveal'>
            <img src=''alt=''/>
            <div className='cardcontent'>
                <h3> การรับเลี้ยงแมวจรดีอย่างไร? </h3>
                <p>การรับเลี้ยงแมวเป็นโอกาสที่ดีที่จะสร้างบรรยากาศสุของครอบครัวนอกจากนี้ การรับเลี้ยงแมวยังสามารถเสริมสร้างความสุขและสมดุลในชีวิตประจำวันของเจ้าของด้วยการเสพติดความรู้สึกของความพอใจและการผ่อนคลายที่มาพร้อมกับการอยู่ร่วมกับแมวที่น่ารักอย่างสิ้นเชิง ดังนั้น การรับเลี้ยงแมวจรเป็นการตัดสินใจที่ดีที่จะเพิ่มคุณค่า
                  และความสุขในชีวิตประจำวันของเราได้อย่างแท้จริง</p>

                <button className='Btn2'>
                  <Link to="/cat"  style={{ textDecoration: 'none', color: 'inherit' }}>Learn More</Link>
                </button>
                
            </div>
        </div>

        <div className='Cardd up'>
            <img src='' alt=''/>
            <div className='cardcontent'>
                <h3>เหตุผลที่คุณควรมีแมว</h3>
                <p>การมีแมวเป็นสัตว์เลี้ยงช่วยเพิ่มความสุขในชีวิตประจำวันของคุณ ด้วยความน่ารักและความฮาที่มักจะทำให้คุณยิ้มได้ทุกวัน.
                  <br/>การดูแลแมวส่งผลให้คุณเรียนรู้การรับผิดชอบและการให้รักและการดูแลสิ่งมีชีวิตอื่น.
                  <br/>การมีสัตว์เลี้ยงมักจะลดความเหงาและเครียด แมวสามารถเป็นเพื่อนที่ดีในเวลาที่คุณต้องการคนที่จะพูดคุยหรือรักษาต่อสมดุลทางจิตใจ.
                </p>

                <button className='Btn2'>
                  <Link to="/product"  style={{ textDecoration: 'none', color: 'inherit' }}>Learn More</Link>
                </button>
            </div>
        </div>

        <div className='Cardd up'>
            <img src='' alt=''/>
            <div className='cardcontent'>
                <h3>เหตุผลที่คุณควรมีแมว</h3>
                <p>การมีแมวเป็นสัตว์เลี้ยงช่วยเพิ่มความสุขในชีวิตประจำวันของคุณ ด้วยความน่ารักและความฮาที่มักจะทำให้คุณยิ้มได้ทุกวัน.
                  <br/>การดูแลแมวส่งผลให้คุณเรียนรู้การรับผิดชอบและการให้รักและการดูแลสิ่งมีชีวิตอื่น.
                  <br/>การมีสัตว์เลี้ยงมักจะลดความเหงาและเครียด แมวสามารถเป็นเพื่อนที่ดีในเวลาที่คุณต้องการคนที่จะพูดคุยหรือรักษาต่อสมดุลทางจิตใจ.
                </p>

                <button className='Btn2'>
                  <Link to="/product"  style={{ textDecoration: 'none', color: 'inherit' }}>Learn More</Link>
                </button>
            </div>
        </div>

        
    </div>

    </div>
      
    </div>
      </div>

          
  )
}

export default About